# BoundaryXRotationFixed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryXRotationFixed Property
ParameterTypeId Class See Also
---
"X Rotation - Fixed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryXRotationFixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryXRotationFixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryXRotationFixed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace